[
  {
    "videoId": "NTVGpy12qNg",
    "title": "Made in Africa: Ethiopian weaver modernises ancient craft",
    "description": "Explore how an Ethiopian weaver is revitalizing traditional hand-weaving techniques for modern audiences."
  },
  {
    "videoId": "hCGieyTOGr8",
    "title": "Aari Women Demonstrating Pottery-making, Ethiopia",
    "description": "Watch Aari women showcase traditional Ethiopian pottery-making methods passed down through generations."
  },
  {
    "videoId": "30PGFTV0buQ",
    "title": "Making Ethiopian Cross Necklace | Jewelry Making Tutorial",
    "description": "Step-by-step guide to crafting a traditional Ethiopian cross necklace using brass."
  },
  {
    "videoId": "0pF3cVsIKoc",
    "title": "How to Hand-Sew African Style Baskets | Traditional Weaving Guide",
    "description": "Learn the art of hand-sewing African-style baskets with this beginner-friendly tutorial."
  },
  {
    "videoId": "76hYyQE3iXE",
    "title": "Handweaving Traditional Ethiopian Scarves",
    "description": "Discover the intricate process of handweaving traditional Ethiopian scarves, known for their unique patterns."
  },
  {
    "videoId": "s5Gzbn-55Og",
    "title": "The Art of Making Traditional Coffee Pot 'Jebena' With CLAY",
    "description": "Delve into the craftsmanship behind creating the iconic Ethiopian clay coffee pot, the Jebena."
  },
  {
    "videoId": "oehNExDhN-k",
    "title": "ET A TO Z - Arts and Crafts - Discover Ethiopia's Unique Craftsmanship",
    "description": "A comprehensive look into Ethiopia's diverse arts and crafts scene, highlighting unique traditional practices."
  },
  {
    "videoId": "d1VpadSDZrc",
    "title": "I am learning how to spin cotton traditionally ፈትል",
    "description": "Experience the traditional Ethiopian method of spinning cotton, a foundational textile skill."
  },
  {
    "videoId": "BJIOzif8XCU",
    "title": "Full tutorial on how to Ethiopian lines and weave on",
    "description": "Detailed tutorial on creating Ethiopian lines and weaving techniques suitable for all skill levels."
  },
  {
    "videoId": "kINVBQcCWTs",
    "title": "The art of embroidery in Ethiopia | Handicraft | Showcase",
    "description": "Explore the rich tradition of Ethiopian embroidery and its cultural significance."
  },
  {
    "videoId": "Z4xg6mf5THM",
    "title": "Ethiopia, Addis Abeba's Pottery Village PT 1",
    "description": "Join a journey through Addis Ababa's pottery village, uncovering the stories of local artisans."
  },
  {
    "videoId": "UzSqn21zb5A",
    "title": "የሸክላ ስራ ጥበብ The Art of Ethiopian pottery",
    "description": "A visual exploration of Ethiopian pottery art, showcasing traditional techniques and designs."
  },
  {
    "videoId": "wJwpRuCV4ac",
    "title": "Salem's Ethiopia | Empowering the local women | Handcraft",
    "description": "Discover how Salem's Ethiopia empowers local women through handcraft and design."
  },
  {
    "videoId": "rxXYE_rGI3s",
    "title": "Ethiopian Style Bookbinding #Tutorial",
    "description": "Learn the steps of Ethiopian-style bookbinding, a unique and historic method of book creation."
  },
  {
    "videoId": "OJe5VmDh3KM",
    "title": "Traditional weaving (Lake Tana, Ethiopia)",
    "description": "Witness traditional weaving practices around Lake Tana, reflecting Ethiopia's rich textile heritage."
  },
  {
    "videoId": "j5-Z1n-oIuE",
    "title": "FTWWL-Ethiopian weavers",
    "description": "A closer look at the lives and techniques of Ethiopian weavers preserving age-old traditions."
  },
  {
    "videoId": "duGWP1JnK5A",
    "title": "DIY [Beginner Sewing] Traditional Ethiopian Dresses",
    "description": "Step-by-step guide to sewing traditional Ethiopian dresses, perfect for beginners."
  },
  {
    "videoId": "EECNSapjP7o",
    "title": "Traditional Jewish Ethiopian (Falasha) Women make hand made pottery",
    "description": "Explore the pottery-making traditions of Ethiopian Jewish women, known as Falasha."
  },
  {
    "videoId": "xGT1gJTrMcQ",
    "title": "Ethiopia 1969 Reel 29 of 65",
    "description": "Historical footage showcasing Ethiopian crafts and daily life from 1969."
  },
  {
    "videoId": "28X9-mIS8T8",
    "title": "Ethiopia's small-holder cotton farmers, weavers and handmade Ethiopian traditional cloth makers",
    "description": "An in-depth look at Ethiopia's cotton farming and weaving industries, highlighting traditional cloth makers."
  },
  {
    "videoId": "Qeo1TE9DiB0",
    "title": "Potters in Ethiopia part1.mp4",
    "description": "Documentary-style video capturing the techniques of Ethiopian potters in their natural environment."
  },
  {
    "videoId": "H238zSEtpIc",
    "title": "Ethiopian Hand Spinning (sabahar)",
    "description": "Demonstration of traditional Ethiopian hand spinning techniques by Sabahar artisans."
  },
  {
    "videoId": "O5leBuMGX0c",
    "title": "Handmade Ethiopian Clay Cooking Pot (Shekila Dist)",
    "description": "Insight into the creation of the Shekila Dist, a traditional Ethiopian clay cooking pot."
  }
]
